import React, { Component } from 'react';
import { Text, View, ScrollView } from 'react-native';
import Navibar from './common/Navibar';

class PrivacyPolicy extends Component {

  render() {
    return (
      <View style={{ flex: 1, backgroundColor: '#f9f9f4' }}>
        <Navibar title='PrivacyPolicy' />
        <ScrollView style={{ backgroundColor: '#f9f9f4' }} >
          <View style={{ flex: 1, marginLeft: 16, marginRight: 16, marginBottom: 20, backgroundColor: '#f9f9f4' }}>
            <Text style={{ color: '#7a5de8', fontSize: 35 }}>개인정보 보호정책</Text>
            <Text style={{ color: '#2e2b4f', fontSize: 15, marginTop: 10 }}>시행일: 2015년 8월 30일</Text>
            <Text style={{ color: '#7a5de8', fontSize: 20, marginTop: 10 }}>[한국어] </Text>
            <Text style={{ color: '#2e2b4f', fontSize: 13, marginTop: 10 }}>
            당사의 서비스는 전 세계의 사람들이 효율적으로 영어를 배울 수 있는 컨텐츠를 바탕으로 화상 영어 회화서비스를 제공합니다.

            본 개인정보 취급방침(“본 방침”)은 귀하가 당사의 서비스를 이용할 때 당사가 귀하의 정보를 언제 어떻게 수집하고 사용하고 공유하는지에 관한 내용을 담고 있습니다. 당사는 링글의 다양한 웹 사이트, SMS, API, 이메일 알림, 애플리케이션, 버튼, 위젯, 광고, 상거래 서비스(“링글 서비스”)와 본 방침과 관련된 당사의 기타 서비스(이하 “서비스” 라 총칭)를 통하여, 그리고 당사의 파트너 및 제3자로부터 귀하의 정보를 수신합니다. 귀하가 당사의 서비스를 이용할 경우, 귀하는 본 방침에 설명된 바와 같이 귀하의 정보를 수집, 전송, 저장, 공개 및 사용하는 것에 동의하는 것입니다.

            미국을 제외한 국가에 거주하는 링글 사용자의 정보는 한국 법인인 “서울특별시 서초구 강남대로 373 13층” 에서 관리 합니다. 귀하가 현재 거주 중인 국가 또는 귀하가 정보를 제공하는 국가가 어디든 간에, 귀하는 당사가 미국, 한국 및 그 외 링글를 사용하는 모든 국가에서 귀하의 정보를 사용할 수 있도록 승인하는 것입니다.

            본 방침에 관하여 궁금한 사항 또는 의견이 있을 경우 admin@ringleplus.com으로 문의하시기 바랍니다.</Text>
            <Text style={{ color: '#7a5de8', fontSize: 20, marginTop: 10 }}>[정보의 수집 및 사용]</Text>
            <Text style={{ color: '#2e2b4f', fontSize: 13, marginTop: 10 }}>
            팁: 당사는 링글 서비스를 제공하고 향후에 이를 평가 및 개선하기 위해 아래와 같은 귀하의 정보를 수집 및 사용합니다.

            기본 계정 정보: 귀하가 링글 계정을 만들거나 재설정하는 경우, 귀하는 귀하의 이름, 사용자 아이디, 비밀번호, 이메일 주소 또는 휴대폰 번호와 같은 개인정보를 제공합니다. 귀하의 이름 및 사용자 아이디는 귀하의 프로필 페이지 및 검색 결과를 포함해 링글 서비스에 공개적으로 게시되며, 귀하의 실명 또는 가명을 사용해도 됩니다. 사용자 공개 프로필의 검색 및 조회 등 일부 링글 서비스는 등록 절차를 거치지 않고도 이용할 수 있습니다.

            연락처 정보: 귀하는 예를 들어, 로그인 인증 절차, SMS를 이용한 링글 등과 같이 귀하의 계정을 맞춤화하거나 서비스를 실행하기 위해 이메일 주소 또는 휴대폰 번호 등 귀하의 연락처 정보를 사용할 수 있습니다. 귀하는 귀하의 휴대폰 번호를 링글에 제공함으로써 이 휴대폰 번호로 링글에서 보내는 문자를 수신하는 데 동의하는 것입니다. 당사는 귀하에게 서비스에 관한 정보를 전달하고 마케팅을 수행하며 스팸, 사기 또는 악용을 방지할 수 있도록 도움을 제공하고, 다른 사용자가 타사 서비스 및 클라이언트 애플리케이션 등을 통하는 경우를 포함해 귀하의 계정을 검색하는 것을 돕기 위해 귀하의 연락처 정보를 사용할 수 있습니다. 귀하는 이메일 및 모바일 알림 설정을 사용해 링글 서비스로부터 수신하는 알림을 관리할 수 있습니다. 또한 알림에 포함된 안내 사항이나 당사의 웹 사이트에 게시된 안내 사항에 따라 알림을 받지 않을 수도 있습니다. 귀하는 다른 사용자가 링글 서비스에서 귀하의 이메일 주소 또는 휴대폰 번호를 통해 귀하를 검색할 수 있도록 허락할지 여부를 귀하의 개인 정보 보호 설정을 통해 관리할 수 있습니다.

            추가 정보: 귀하는 링글 서비스에 공개하기 위하여 귀하의 약력, 위치, 웹 사이트 또는 사진과 같은 프로필 정보를 당사에 제공할 수 있습니다. 귀하는 귀하가 알고 있는 링글 사용자를 찾거나 다른 링글 사용자가 귀하를 찾을 수 있도록 귀하의 주소록을 업로드할지 여부를 선택할 수 있습니다. 당사는 귀하가 제공한 주소록의 연락처를 바탕으로 차후에 링글에서 귀하와 다른 사용자에게 추천을 할 수도 있습니다. 귀하는 해당 주소록의 연락처 정보를 언제든지 링글에서 삭제할 수 있습니다. 자세한 내용은 여기를 참조하시기 바랍니다. 이메일로 문의하실 경우 당사는 귀하의 요청에 응답하기 위해 귀하의 쪽지, 이메일 주소 및 연락처 정보를 보관할 수 있습니다.

            당사는 귀하가 링글 서비스를 통하여 당사에게 제공하는 정보를 귀하가 직접 삭제하기 전까지는 공개하는 것을 기본 원칙으로 하고 있습니다. 링글 서비스는 다양한 범위의 사용자, 고객 및 서비스를 대상으로 귀하의 공개 정보를 즉시 광범위하게 전파합니다. 귀하가 본 서비스를 통해 사진, 동영상, 링크 등의 정보나 콘텐츠를 공유할 경우 어떤 정보를 공개할 것인지를 신중히 고려하시기 바랍니다.

            쿠키: 많은 웹 사이트와 마찬가지로, 당사는 웹 사이트 사용 데이터를 추가로 수집하고 당사의 서비스를 개선하기 위해 쿠키 및 이와 유사한 기술을 사용하고 있으며, 다만 당사의 서비스 중 상당수(사용자 공개 프로필의 검색 및 열람 등)에서는 쿠키를 요구하지 않습니다. 쿠키는 귀하의 컴퓨터 또는 모바일 디바이스로 전송되는 소규모 데이터 파일입니다. 링글는 당사의 서비스에 대해 귀하가 어떻게 반응하는지를 보다 잘 파악하고, 링글 사용자들의 전반적인 서비스 이용과 당사의 서비스상에서 웹 트래픽 라우팅을 모니터링하며, 당사의 서비스를 사용자의 요구에 맞게 제공하고 개선하기 위해 세션(session) 쿠키와 퍼시스턴트(persistent) 쿠키를 모두 사용할 수 있습니다. 대부분의 인터넷 브라우저는 쿠키를 자동으로 수신합니다. 귀하는 브라우저의 설정을 변경하여 브라우저가 쿠키를 수신하는 것을 중단하거나 귀하가 방문하는 웹 사이트에서 쿠키를 수신하기 전에 알림을 받을 수 있습니다. 다만 쿠키 기능을 사용하지 않도록 설정할 경우 일부 서비스가 제대로 작동하지 않을 수도 있습니다.

            로그 데이터: 귀하가 본 서비스를 이용할 경우 당사는 귀하의 IP 주소, 브라우저 유형, 운영 체제, 참고한 웹 페이지, 방문한 페이지, 위치, 귀하의 이동통신사, 디바이스 정보(디바이스 및 애플리케이션 ID 포함), 검색어 및 쿠키 정보 등 다양한 정보(“로그 데이터”)를 수신할 수 있습니다. 당사는 예를 들어, 귀하가 당사의 웹 사이트를 방문하거나, 당사의 서비스에 가입하거나, 당사의 이메일 알림에 반응하거나, 타사 웹 사이트 또는 애플리케이션에 대한 인증을 위해 귀하의 계정을 이용하거나 링글 버튼 또는 위젯이 포함된 타사 웹 사이트를 방문하는 등 귀하가 다양한 형태로 당사의 서비스에 반응할 때에 로그 데이터를 수신합니다. 또한 귀하가 링글를 통해 다른 애플리케이션을 설치하는 등 본 서비스상의 링크들(타사 애플리케이션들에 대한 링크들 포함)를 클릭해 이를 보거나 그러한 링크에 반응할 때에도 당사는 로그 데이터를 수신할 수 있습니다. 링글는 본 서비스를 제공, 파악 및 개선하는 것은 물론, 귀하의 관심 분야 등을 유추하고 귀하에게 광고를 포함하여 맞춤화된 콘텐츠를 보여주기 위하여 로그 데이터를 사용합니다. 예를 들어 아래의 위젯 데이터에 대한 설명에서 밝혔듯이 이전에 삭제나 제거가 되지 않은 경우 당사는 최장 18개월이 경과한 이후에 로그 데이터를 삭제하거나 귀하의 사용자 아이디, 전체 IP 주소, 이메일 주소와 같은 일반적인 계정 식별자를 제거합니다.

            위젯 데이터: 당사는 귀하가 링글 버튼이나 위젯이 통합되어 있는 타사 웹 사이트에 방문한 내역을 바탕으로 귀하에게 맞춤화된 서비스를 제공할 수 있습니다. 이러한 웹 사이트들이 콘텐츠를 게시하기 위해 당사의 버튼이나 위젯을 먼저 로드하는 경우 당사는 귀하가 방문한 웹 페이지와 귀하의 브라우저를 식별하는 쿠키를 포함한 로그 데이터(“위젯 데이터”)를 수신합니다. 위젯 데이터를 수신한 후 최장 10일이 경과하면 당사는 이 데이터를 삭제, 비식별화 또는 통합하는 절차를 진행하며 이 절차는 통상 바로 시작되지만 경우에 따라서는 최장 1주까지 소요될 수 있습니다. 당사는 링글에서 팔로우할 사람들과 귀하의 관심을 끌만한 그 밖의 콘텐츠를 추천하는 등 귀하에게 맞춤화된 콘텐츠를 제공하기 위해 위젯 데이터를 사용할 수 있습니다. 맞춤형 콘텐츠는 브라우저 쿠키 또는 디바이스 ID를 통해서만 저장되며 페이지 방문 정보와 같은 기타 위젯 데이터와는 분리됩니다.

            제3자 및 계열사: 링글는 당사의 다양한 블로그 및 위키(Wiki)의 호스팅과 같이 당사의 서비스의 제공을 지원하고, 구글 애널리틱스(Google Analytics)와 같이 당사 서비스의 이용 내역을 파악하고 개선하기 위한 목적으로 다양한 제3자 서비스를 활용합니다. 이러한 제3자 서비스 제공자들은 웹 페이지 요청의 일부로서 귀하의 브라우저가 전송한 쿠키나 IP 주소 등과 같은 정보를 수집할 수 있습니다. 제3자 광고 파트너들은 브라우저 쿠키 ID, 사용자가 방문한 웹 사이트 URL, 모바일 디바이스 ID 또는 일반 계정 식별자의 암호화 해시값(예: 이메일 주소)과 같은 정보를 당사와 공유하여 당사가 광고를 평가하고 맞춤형 광고를 제공하는 데 도움을 줄 수 있습니다. 또한 당사는 광고 게재를 포함해 본 서비스와 계열사의 서비스를 제공, 파악, 개선하는 데 도움을 줄 목적으로 당사의 기업 계열사로부터 귀하에 관한 정보를 수신할 수도 있습니다.
            </Text>
            <Text style={{ color: '#7a5de8', fontSize: 20, marginTop: 10 }}>[정보의 공유 및 공개]</Text>
            <Text style={{ color: '#2e2b4f', fontSize: 13, marginTop: 10 }}>
            팁: 당사는 본 방침에 명시된 제한적인 경우를 제외하면 귀하의 사적인 개인정보를 공개하지 않습니다.

            사용자 동의 또는 지시: 당사는 귀하가 타사 웹 클라이언트 또는 애플리케이션이 귀하의 계정에 접근하는 것을 승인한 경우와 같이 귀하의 지시에 따라 귀하의 정보를 공유 또는 공개할 수 있습니다. 귀하의 개인 정보 보호 설정은 링글 서비스에 업로드된 사진에서 귀하를 태그할 수 있는 사용자를 관리합니다.

            튜터: 수업의 효과를 극대화 하기위하여 당사는 튜터에게 고객의 이름, 회사/학교 정보 및 해당 고객이 입력한 정보를 튜터와 공유, 관리 합니다.

            서비스 제공자: 당사는 미국, 한국 및 그 외 국가에서, 업무를 수행하고 당사에게 서비스를 제공하도록 하기 위하여 서비스 제공자를 활용합니다. 당사는 이러한 서비스 제공자들이 본 방침과 그 외 적절한 기밀유지 및 보안 조치 상의 제반 의무를 준수하고 오로지 당사를 위하여, 그리고 당사의 지시에 따라 귀하의 사적인 개인정보를 사용하여야 한다는 조건 하에, 서비스 제공자들과 귀하의 사적인 개인정보를 공유할 수 있습니다. 당사는 결제를 처리하고 사기 또는 기타 금지된 활동을 예방, 적발 및 조사하며, 입금 취소 또는 환불 등의 방법을 통해 분쟁을 보다 원만하게 해결하고 신용카드 또는 직불카드의 결제 승인과 관련된 그 밖의 목적을 위해 결제 서비스 제공자와 귀하의 결제 정보를 공유합니다. 당사는 카드와 연계된 서비스를 제공하기 위한 목적으로 참여 판매자를 통한 카드 거래를 모니터하고 상환 내역을 관리하기 위해 귀하의 신용카드 번호 또는 직불카드 번호를 결제 서비스 제공자나 카드 네트워크와 공유할 수 있습니다.

            상품 및 서비스의 판매자: 귀하가 당사의 서비스를 통해 상품 또는 서비스를 구매할 경우 당사는 결제 처리, 주문 이행 및 분쟁 해결(결제 및 배송 분쟁 포함)을 원만하게 진행하고 사기 또는 기타 금지된 활동을 예방, 적발 및 조사하는 데 도움을 주기 위해 귀하의 이름, 이메일 주소, 배송지 주소, 결제 정보 및 거래 정보를 판매자, 상거래 서비스 제공자 또는 마켓플레이스에 제공할 수 있습니다. 제3자의 개인정보 보호 사례에 관한 자세한 내용은 해당 제3자의 개인정보 취급방침을 참조하세요.

            법률 및 피해: 본 방침에 상반되는 규정이 존재하더라도, 당사가 어떤 법률, 규정 또는 법적 절차 내지 정부의 요청을 준수하거나 특정인의 안전을 보호하거나 사기, 보안 또는 기술적인 문제를 해결하거나 링글의 권리나 재산을 보호할 합리적인 필요가 있다고 판단될 경우 당사는 귀하의 정보를 보관하거나 공개할 수 있습니다. 그러나 본 방침의 어떠한 규정도 귀하의 정보를 공개하라는 제3자의 요청(정부의 요청 포함)에 대해 귀하가 취할 수 있는 법적 방어 내지 이의를 제한하려는 의도가 없습니다.

            사업 양도 및 계열사: 링글이 파산, 합병, 인수, 구조조정 또는 자산매각 절차에 연관되는 경우 귀하의 정보는 그러한 거래의 일환으로 매각 또는 양도될 수 있습니다. 본 개인정보 취급방침은 새로운 사업체에 이전되는 귀하의 정보에 적용될 것입니다. 또한 당사는 광고 게재를 포함해 본 서비스와 계열사의 서비스를 제공하고 이해하며 개선하는 데 도움을 줄 목적으로 귀하에 관한 정보를 당사의 기업 계열사에게 공개할 수도 있습니다.

            공개 정보 또는 비개인적인 정보: 당사는 귀하의 사용자 공개 프로필 정보, 귀하의 수업 수, 수업 세부사항 ( 튜터의 이름, 수업 자료링크, 수업후 수업 분석 노트 등 ) 같은 귀하의 공개 정보, 통계 정보 또는 기타 비개인적인 정보 또는 당사가 사적인 개인정보(예: 귀하의 이름 또는 연락처 정보)를 삭제한 광고를 보거나 클릭한 특정 사용자에 관한 보고서를 공유하거나 공개할 수 있습니다.
            </Text>
            <Text style={{ color: '#7a5de8', fontSize: 20, marginTop: 10 }}>[ 귀하의 개인정보에 대한 접근 및 수정 ]</Text>
            <Text style={{ color: '#2e2b4f', fontSize: 13, marginTop: 10 }}>
            귀하가 본 서비스에 등록된 사용자인 경우 당사는 귀하가 당사에 제공했거나 귀하의 계정과 관련된 개인정보에 대해 접근하고 그러한 정보를 정정, 삭제 또는 수정할 수 있는 도구 및 계정 설정을 제공합니다.

            또한 귀하는 귀하의 링글 계정을 영구 삭제할 수도 있습니다. 홈페이지의 지침을 따르면 귀하의 계정은 비활성화된 후 삭제됩니다. 귀하의 계정이 비활성화되면 www.ringleplus.com 에서 이 계정이 표시되지 않습니다.
            </Text>
            <Text style={{ color: '#7a5de8', fontSize: 20, marginTop: 10 }}>[ 본 방침의 개정 ]</Text>
            <Text style={{ color: '#2e2b4f', fontSize: 13, marginTop: 10 }}>
            당사는 본 방침을 수시로 개정할 수 있습니다. 당사에 의한 귀하의 정보의 사용은 본 방침의 최신 버전에 의해 규율될 것이며, 해당 방침은 www.ringleplus.com/policy 에 항상 게재되어 있을 것입니다. 당사의 완전한 재량에 따라 본 방침의 내용이 중대하게 개정되었다고 판단될 경우 당사는 홈페이지 업데이트를 통해 또는 귀하의 계정과 연결된 이메일을 통해 귀하에게 고지할 것입니다. 귀하는 개정된 본 방침이 시행된 이후에도 당사의 서비스에 계속 접근하거나 이를 사용함으로써 개정된 개인정보 취급방침의 적용을 받는 것에 동의하는 것입니다.
            </Text>
            <Text style={{ color: '#7a5de8', fontSize: 15, marginTop: 10 }}>본 개인정보 취급방침에 관해 궁금한 점이나 의견이 있으면 contact@ringleplus.com 문의하시기 바랍니다.</Text>
          </View>
        </ScrollView>
      </View>
    );
  }
}

export default PrivacyPolicy;
